__author__ = 'Михайловский Василий Владимирович'

a1=(-1,-1)
a2=(-3,-3)
a3=(-4,-4)
a4=(-2,-2)

a1a3kv=(a3[0]-a1[0])**2+(a3[1]-a1[1])**2
a2a4kv=(a4[0]-a2[0])**2+(a4[1]-a2[1])**2

a1a2kv=(a2[0]-a1[0])**2+(a2[1]-a1[1])**2
a1a4kv=(a4[0]-a1[0])**2+(a4[1]-a1[1])**2


print(a1a3kv)
print(a2a4kv)
print(a1a2kv)
print(a1a4kv)

cosa=round((a2a4kv-a1a2kv-a1a4kv)/(-1*2*(a1a2kv**0.5)*(a1a4kv**0.5)),4)
print(cosa)

if (a1a3kv+a2a4kv)==(2*a1a2kv +2*a1a4kv ) and cosa != 1:
    print('Это параллелограмм, так как cумма квадратов диагоналей ')
    print('равна сумме квадратов его сторон')
elif cosa == 1:
    print('точки расположенны на прямой')
    print('нет это не параллелограмм!!')
else:
    print('нет это не параллелограмм!!')

